{
  "_name_or_path": "/kaggle/input/datasets/phanphat/layoutlmv3/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-INVOICE_TYPE",
    "1": "B-INVOICE_DATE",
    "2": "B-INVOICE_SYMBOL",
    "3": "B-INVOICE_NUMBER",
    "4": "B-SELLER_NAME",
    "5": "B-SELLER_TAX_CODE",
    "6": "B-SELLER_TAX_AUTHORITY_CODE",
    "7": "B-SELLER_ADDRESS",
    "8": "B-BUYER_NAME",
    "9": "B-BUYER_TAX_CODE",
    "10": "B-BUYER_ADDRESS",
    "11": "B-PAYMENT_METHOD",
    "12": "I-INVOICE_TYPE",
    "13": "I-INVOICE_DATE",
    "14": "I-INVOICE_SYMBOL",
    "15": "I-INVOICE_NUMBER",
    "16": "I-SELLER_NAME",
    "17": "I-SELLER_TAX_CODE",
    "18": "I-SELLER_TAX_AUTHORITY_CODE",
    "19": "I-SELLER_ADDRESS",
    "20": "I-BUYER_NAME",
    "21": "I-BUYER_TAX_CODE",
    "22": "I-BUYER_ADDRESS",
    "23": "I-PAYMENT_METHOD",
    "24": "O"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-BUYER_ADDRESS": 10,
    "B-BUYER_NAME": 8,
    "B-BUYER_TAX_CODE": 9,
    "B-INVOICE_DATE": 1,
    "B-INVOICE_NUMBER": 3,
    "B-INVOICE_SYMBOL": 2,
    "B-INVOICE_TYPE": 0,
    "B-PAYMENT_METHOD": 11,
    "B-SELLER_ADDRESS": 7,
    "B-SELLER_NAME": 4,
    "B-SELLER_TAX_AUTHORITY_CODE": 6,
    "B-SELLER_TAX_CODE": 5,
    "I-BUYER_ADDRESS": 22,
    "I-BUYER_NAME": 20,
    "I-BUYER_TAX_CODE": 21,
    "I-INVOICE_DATE": 13,
    "I-INVOICE_NUMBER": 15,
    "I-INVOICE_SYMBOL": 14,
    "I-INVOICE_TYPE": 12,
    "I-PAYMENT_METHOD": 23,
    "I-SELLER_ADDRESS": 19,
    "I-SELLER_NAME": 16,
    "I-SELLER_TAX_AUTHORITY_CODE": 18,
    "I-SELLER_TAX_CODE": 17,
    "O": 24
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
