{
  "_name_or_path": "/kaggle/input/datasets/phanphat/layoutlmv3/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ITEM_NAME",
    "1": "B-ITEM_UNIT",
    "2": "B-ITEM_QUANTITY",
    "3": "B-ITEM_UNIT_PRICE",
    "4": "B-ITEM_TOTAL_PRICE",
    "5": "B-ITEM_DISCOUNT",
    "6": "B-ITEM_VAT_RATE",
    "7": "B-ITEM_LINE_TAX",
    "8": "B-ITEM_ROW_TOTAL",
    "9": "I-ITEM_NAME",
    "10": "I-ITEM_UNIT",
    "11": "I-ITEM_QUANTITY",
    "12": "I-ITEM_UNIT_PRICE",
    "13": "I-ITEM_TOTAL_PRICE",
    "14": "I-ITEM_DISCOUNT",
    "15": "I-ITEM_VAT_RATE",
    "16": "I-ITEM_LINE_TAX",
    "17": "I-ITEM_ROW_TOTAL",
    "18": "O"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ITEM_DISCOUNT": 5,
    "B-ITEM_LINE_TAX": 7,
    "B-ITEM_NAME": 0,
    "B-ITEM_QUANTITY": 2,
    "B-ITEM_ROW_TOTAL": 8,
    "B-ITEM_TOTAL_PRICE": 4,
    "B-ITEM_UNIT": 1,
    "B-ITEM_UNIT_PRICE": 3,
    "B-ITEM_VAT_RATE": 6,
    "I-ITEM_DISCOUNT": 14,
    "I-ITEM_LINE_TAX": 16,
    "I-ITEM_NAME": 9,
    "I-ITEM_QUANTITY": 11,
    "I-ITEM_ROW_TOTAL": 17,
    "I-ITEM_TOTAL_PRICE": 13,
    "I-ITEM_UNIT": 10,
    "I-ITEM_UNIT_PRICE": 12,
    "I-ITEM_VAT_RATE": 15,
    "O": 18
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
